<script setup>
import Maps from '@/components/Maps.vue'
import Breadcrumbs from '@/components/Breadcrumbs.vue'
</script>

<template>
  <Breadcrumbs />
  <div class="contacts">
    <div class="container">
      <h1 class="contacts__title main-title">Контакты</h1>
      <div class="contacts__wrapper">
        <div class="contacts__item contacts__item-tel contacts__item-inner">
          <a href="tel:+74012777747" class="office__info-flip-tel">+7 4012 77 7747</a>
          <p>телефон для связи</p>
        </div>
        <div class="contacts__item contacts__item-email contacts__item-inner">
          <a href="mailto:secretar@akfen39.ru">info@akfen39.ru</a>
          <p>почта для писем</p>
        </div>
        <div class="contacts__item contacts__item-email contacts__item-inner">
          <a href="mailto:secretar@akfen39.ru">info@akfen39.ru</a>
          <p>почта для предложений рекламы</p>
        </div>
        <div class="contacts__item contacts__item-address">
          <span href="mailto:secretar@akfen39.ru">Калининград, ул. Генерала Челнокова, дом 52</span>
          <p>Центральный офис компании</p>
        </div>
        <div class="contacts__item contacts__item-schedule">
          <span href="mailto:secretar@akfen39.ru">пн-пт 9:15-18:00 <br />сб 10:00-15:00</span>
          <p>Режим работы</p>
        </div>
        <div class="contacts__item contacts__item-social">
          <div class="contacts__item-social-inner">
            <a href="https://wa.me/79114701905" target="_blank" rel="noopener noreferrer">
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M19.7195 3.76874C17.5463 1.60312 14.6488 0.399994 11.5902 0.399994C5.23171 0.399994 0.0804866 5.53333 0.0804866 11.8698C0.0804866 13.875 0.643902 15.8802 1.60976 17.5646L0 23.5L6.11708 21.8958C7.80732 22.7781 9.65854 23.2594 11.5902 23.2594C17.9488 23.2594 23.1 18.126 23.1 11.7896C23.0195 8.82187 21.8927 5.93437 19.7195 3.76874ZM17.1439 15.9604C16.9024 16.6021 15.7756 17.2437 15.2122 17.324C14.7293 17.4042 14.0854 17.4042 13.4415 17.2437C13.039 17.0833 12.4756 16.9229 11.8317 16.6021C8.93415 15.399 7.08293 12.5115 6.92195 12.2708C6.76098 12.1104 5.71464 10.7469 5.71464 9.30312C5.71464 7.85937 6.43902 7.2177 6.68049 6.89687C6.92195 6.57604 7.2439 6.57604 7.48537 6.57604C7.64634 6.57604 7.8878 6.57604 8.04878 6.57604C8.20975 6.57604 8.45122 6.49583 8.69268 7.05729C8.93415 7.61874 9.49756 9.06249 9.57805 9.1427C9.65854 9.30312 9.65854 9.46354 9.57805 9.62395C9.49756 9.78437 9.41707 9.94479 9.25609 10.1052C9.09512 10.2656 8.93414 10.5062 8.85366 10.5865C8.69268 10.7469 8.53171 10.9073 8.69268 11.1479C8.85366 11.4687 9.41707 12.351 10.3024 13.1531C11.4293 14.1156 12.3146 14.4365 12.6366 14.5969C12.9585 14.7573 13.1195 14.6771 13.2805 14.5167C13.4415 14.3562 14.0049 13.7146 14.1659 13.3937C14.3268 13.0729 14.5683 13.1531 14.8098 13.2333C15.0512 13.3135 16.5 14.0354 16.7415 14.1958C17.0634 14.3562 17.2244 14.4365 17.3049 14.5167C17.3854 14.7573 17.3854 15.3187 17.1439 15.9604Z"
                  fill="white"
                />
              </svg>
            </a>
            <a href="https://t.me/akfen_39" target="_blank" rel="noopener noreferrer">
              <svg
                width="23"
                height="20"
                viewBox="0 0 23 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M1.28616 9.91148L6.34407 11.7975L8.31578 18.1413C8.40151 18.5699 8.91587 18.6556 9.25878 18.3985L12.0878 16.0838C12.3449 15.8266 12.7736 15.8266 13.1165 16.0838L18.1744 19.7701C18.5173 20.0273 19.0317 19.8558 19.1174 19.4272L22.8894 1.42452C22.9751 0.995883 22.5465 0.567253 22.1178 0.738707L1.28616 8.79704C0.7718 8.96849 0.7718 9.74003 1.28616 9.91148ZM8.05861 10.8545L18.0029 4.76787C18.1744 4.68214 18.3458 4.93933 18.1744 5.02505L10.0303 12.6547C9.77314 12.9119 9.51595 13.2548 9.51595 13.6835L9.25878 15.7409C9.25878 15.9981 8.83014 16.0838 8.74441 15.7409L7.71568 11.9689C7.4585 11.5403 7.62997 11.0259 8.05861 10.8545Z"
                  fill="white"
                />
              </svg>
            </a>
            <a href="https://vk.com/akfen39" target="_blank" rel="noopener noreferrer">
              <svg
                width="23"
                height="14"
                viewBox="0 0 23 14"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M22.7869 12.1269C22.7869 12.0355 22.6955 12.0355 22.6955 11.9442C22.3302 11.2136 21.5083 10.3004 20.4124 9.29578C19.8645 8.83915 19.5905 8.47384 19.4078 8.29119C19.1338 7.92589 19.1339 7.65193 19.2252 7.28662C19.3165 7.01265 19.6818 6.55601 20.3211 5.73408C20.6864 5.27746 20.869 5.00349 21.143 4.72952C22.5129 2.90301 23.1521 1.71577 22.9695 1.16782L22.8782 1.07651C22.7869 0.985181 22.6955 0.893858 22.5129 0.893858C22.3302 0.802533 22.0563 0.802533 21.7823 0.893858H18.3119C18.2206 0.893858 18.2206 0.893858 18.0379 0.893858C17.9466 0.893858 17.8553 0.893858 17.8553 0.893858H17.764H17.6726L17.5813 0.985175C17.49 1.0765 17.49 1.0765 17.49 1.16782C17.1247 2.1724 16.6681 2.99433 16.2114 3.90758C15.9375 4.36421 15.6635 4.82084 15.3895 5.18614C15.1155 5.55144 14.9329 5.82541 14.7502 6.00806C14.5676 6.19071 14.3849 6.28204 14.2936 6.46469C14.2023 6.55601 14.0196 6.64735 14.0196 6.55602C13.9283 6.55602 13.837 6.55601 13.837 6.46469C13.7457 6.37336 13.6543 6.28204 13.563 6.19071C13.4717 6.09939 13.4717 5.91673 13.3803 5.73408C13.3803 5.55143 13.3803 5.36878 13.3803 5.27746C13.3803 5.18613 13.3803 4.91217 13.3803 4.72952C13.3803 4.45554 13.3803 4.27288 13.3803 4.18156C13.3803 3.90758 13.3803 3.54229 13.3803 3.17699C13.3803 2.81169 13.3803 2.5377 13.3803 2.35505C13.3803 2.1724 13.3803 1.89843 13.3803 1.71578C13.3803 1.4418 13.3803 1.25915 13.3803 1.16782C13.3803 1.0765 13.289 0.893853 13.289 0.802528C13.1977 0.711202 13.1064 0.619874 13.0151 0.528549C12.9237 0.437224 12.7411 0.437227 12.6498 0.345901C12.1931 0.254576 11.6452 0.163254 11.0059 0.163254C9.54471 0.163254 8.54013 0.254582 8.17483 0.437232C7.99218 0.528557 7.80953 0.619877 7.7182 0.802528C7.53555 0.985178 7.53555 1.07651 7.62687 1.07651C8.0835 1.16783 8.4488 1.35047 8.63145 1.62445L8.72278 1.80711C8.81411 1.89844 8.81409 2.08108 8.90542 2.35505C8.99674 2.62903 8.99675 2.90301 8.99675 3.26831C8.99675 3.81626 8.99675 4.36421 8.99675 4.72952C8.99675 5.18614 8.90542 5.46011 8.90542 5.73408C8.90542 6.00806 8.81411 6.19072 8.72278 6.28204C8.63146 6.46469 8.63145 6.55602 8.54012 6.55602C8.54012 6.55602 8.54012 6.64734 8.44879 6.64734C8.35747 6.64734 8.26615 6.73867 8.0835 6.73867C7.99217 6.73867 7.80953 6.64735 7.7182 6.55602C7.53555 6.46469 7.3529 6.28204 7.26158 6.09939C7.07893 5.91674 6.89627 5.64276 6.71362 5.27746C6.53097 4.91216 6.25698 4.54686 6.07433 3.99891L5.8917 3.63362C5.80037 3.45096 5.61772 3.08566 5.43507 2.62903C5.25242 2.17241 5.06977 1.80711 4.88711 1.35048C4.79579 1.16783 4.70448 1.0765 4.61315 0.985175H4.52182C4.52182 0.985175 4.43048 0.893858 4.33916 0.893858C4.24783 0.893858 4.15652 0.802528 4.06519 0.802528H0.77748C0.412179 0.802528 0.229531 0.89385 0.138206 0.985175L0.046875 1.07651C0.046875 1.07651 0.046875 1.16783 0.046875 1.25915C0.046875 1.35048 0.0468806 1.4418 0.138206 1.62445C0.594832 2.72035 1.14278 3.81626 1.69073 4.91216C2.23868 5.91674 2.78664 6.83 3.15194 7.46927C3.60857 8.10855 3.97386 8.74783 4.43049 9.29578C4.88711 9.84373 5.16108 10.209 5.25241 10.3917C5.43506 10.5743 5.52638 10.6656 5.61771 10.757L5.8917 11.031C6.07435 11.2136 6.34832 11.4876 6.71362 11.7616C7.07892 12.0355 7.53554 12.3095 7.99217 12.5835C8.44879 12.8575 8.99676 13.0401 9.54471 13.2228C10.184 13.4054 10.7319 13.4967 11.2799 13.4054H12.6498C12.9237 13.4054 13.1064 13.3141 13.289 13.1314L13.3803 13.0401C13.3803 12.9488 13.4717 12.9488 13.4717 12.8575C13.4717 12.7661 13.4717 12.6748 13.4717 12.4922C13.4717 12.1269 13.4717 11.8529 13.563 11.5789C13.6543 11.3049 13.6543 11.1223 13.7457 10.9396C13.837 10.757 13.9283 10.6656 14.0196 10.5743C14.111 10.483 14.2023 10.3917 14.2023 10.3917H14.2936C14.4763 10.3004 14.7502 10.3917 14.9329 10.5743C15.2069 10.757 15.4808 11.031 15.6635 11.3049C15.8461 11.5789 16.1201 11.8529 16.4854 12.2182C16.8507 12.5835 17.1247 12.8575 17.3074 12.9488L17.5813 13.1314C17.764 13.2228 17.9466 13.3141 18.2206 13.4054C18.4946 13.4967 18.6772 13.4967 18.8599 13.4967L21.9649 13.4054C22.2389 13.4054 22.5129 13.3141 22.6955 13.2228C22.8782 13.1314 22.9695 13.0401 22.9695 12.8575C22.9695 12.7661 22.9695 12.5835 22.9695 12.4922C22.7868 12.3095 22.7869 12.2182 22.7869 12.1269Z"
                  fill="white"
                />
              </svg>
            </a>
            <a href="https://rutube.ru/channel/48163744/" target="_blank" rel="noopener noreferrer">
              <svg
                width="20"
                height="15"
                viewBox="0 0 20 15"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M19.5841 6.30443C19.5841 5.87776 19.513 5.37999 19.513 4.8111C19.4419 4.24222 19.3707 3.67332 19.2996 3.17555C19.1574 2.60666 18.9441 2.18 18.5174 1.82444C18.1618 1.46888 17.6641 1.25555 17.1663 1.18443C15.5307 0.971101 13.113 0.899994 9.84184 0.899994C6.57073 0.899994 4.08183 0.971101 2.51738 1.18443C2.01961 1.25555 1.52183 1.46888 1.16628 1.82444C0.810721 2.18 0.526272 2.60666 0.38405 3.17555C0.241827 3.67332 0.170725 4.1711 0.170725 4.8111C0.0996137 5.37999 0.0996094 5.87776 0.0996094 6.30443C0.0996094 6.7311 0.0996094 7.22888 0.0996094 7.93999C0.0996094 8.6511 0.0996094 9.21999 0.0996094 9.57555C0.0996094 10.0022 0.170725 10.5 0.170725 11.0689C0.241836 11.6378 0.312938 12.2067 0.38405 12.7044C0.526272 13.2733 0.73961 13.7 1.16628 14.0555C1.52183 14.4111 2.01961 14.6244 2.51738 14.6955C4.15294 14.9089 6.57073 14.98 9.84184 14.98C13.113 14.98 15.6018 14.9089 17.1663 14.6955C17.6641 14.6244 18.1618 14.4111 18.5174 14.0555C18.8729 13.7 19.1574 13.2733 19.2996 12.7044C19.4418 12.2067 19.513 11.7089 19.513 11.0689C19.5841 10.5 19.5841 10.0022 19.5841 9.57555C19.5841 9.14888 19.5841 8.6511 19.5841 7.93999C19.5841 7.22888 19.5841 6.65999 19.5841 6.30443ZM13.6107 8.50888L7.99295 11.9933C7.92184 12.0644 7.77962 12.1356 7.63739 12.1356C7.49517 12.1356 7.42406 12.1355 7.28184 12.0644C7.0685 11.9222 6.92628 11.7089 6.92628 11.4244V4.38443C6.92628 4.09999 7.0685 3.88666 7.28184 3.74444C7.49517 3.60222 7.77962 3.60222 7.99295 3.74444L13.6107 7.22888C13.8241 7.3711 13.9663 7.58444 13.9663 7.79777C13.9663 8.0111 13.8241 8.36666 13.6107 8.50888Z"
                  fill="white"
                />
              </svg>
            </a>
          </div>
          <p>Мы в соц. сетях</p>
        </div>
      </div>
      <div class="contacts__plate">
        <div class="contacts__plate-left">
          <img src="/public/imgs/logo-inner.png" alt="" loading="lazy" decoding="async" />
        </div>
        <div class="contacts__plate-right">
          <p class="contacts__plate-right-title">Если у вас есть вопросы или предложения</p>
          <p class="contacts__plate-right-text">
            Напишите нам, чтобы мы могли дать вам обратную связь и обсудить решение
          </p>
          <p class="contacts__plate-right-email">
            Почта для связи: <a href="mailto:secretar@akfen39.ru">info@akfen39.ru</a>
          </p>
        </div>
      </div>
    </div>
  </div>
  <Maps></Maps>
</template>

<style lang="scss" scoped>
@import '../assets/styles/index';

.contacts {
  font-family: var(--font-family);
  &__wrapper {
    margin-top: clamp(30px, vw(40px, $desktop), 40px);
    margin-bottom: clamp(30px, vw(40px, $desktop), 40px);
    display: grid;
    grid-template-columns: 1fr;
    row-gap: clamp(22px, vw(40px, $desktop), 40px);
    column-gap: clamp(20px, vw(20px, $desktop), 20px);
    @media (min-width: $tab) {
      grid-template-columns: repeat(2, 1fr);
    }
    @media (min-width: $desk) {
      grid-template-columns: repeat(3, 1fr);
    }
  }
  &__item {
    max-width: clamp(440px, vw(440px, $desktop), 440px);
    width: 100%;
  }
  &__item > a,
  &__item span {
    font-weight: 400;
    font-size: clamp(26px, vw(30px, $desktop), 30px);
    line-height: 117%;
    letter-spacing: -0.01em;
    color: var(--100);
    margin-bottom: clamp(4px, vw(5px, $desktop), 5px);
  }
  &__item-inner > a:hover {
    color: var(--1);
  }

  &__item p {
    font-weight: 400;
    font-size: clamp(16px, vw(18px, $desktop), 18px);
    line-height: 146%;
    color: var(--60);
  }
  &__item-social-inner {
    display: flex;
    gap: clamp(10px, vw(12px, $desktop), 12px);
  }
  &__item-social-inner {
    a {
      position: relative;
      border-radius: 100%;
      width: clamp(44px, vw(44px, $desktop), 44px);
      height: clamp(44px, vw(44px, $desktop), 44px);
      // display: flex;
      // align-items: center;
      // justify-content: center;

      svg {
        position: absolute;
        top: 50%;
      }

      &:nth-child(1) {
        background-color: #477750;

        svg {
          width: clamp(21px, vw(23px, $desktop), 23px);
          height: clamp(21px, vw(23px, $desktop), 23px);
          left: 50%;
          transform: translate(-45%, -50%);
        }
        &:hover {
          background-color: #5d9967;
        }
      }

      &:nth-child(2) {
        background-color: #287cbc;

        svg {
          width: clamp(21px, vw(23px, $desktop), 23px);
          height: clamp(21px, vw(23px, $desktop), 23px);
          left: 45%;
          transform: translate(-50%, -50%);
        }
        &:hover {
          background-color: #3e94d5;
        }
      }
      &:nth-child(3) {
        background-color: var(--2);

        svg {
          width: clamp(21px, vw(23px, $desktop), 23px);
          height: clamp(21px, vw(23px, $desktop), 23px);
          left: 45%;
          transform: translate(-50%, -45%);
        }
        &:hover {
          background-color: #475ae0;
        }
      }
      &:nth-child(4) {
        background-color: var(--1);

        svg {
          width: clamp(21px, vw(23px, $desktop), 23px);
          height: clamp(21px, vw(23px, $desktop), 23px);
          left: 50%;
          transform: translate(-50%, -50%);
        }
        &:hover {
          background-color: #f0292e;
        }
      }
    }
  }
  &__plate {
    background: var(--seryy);
    border-radius: 30px;
    padding: clamp(15px, vw(16px, $desktop), 16px) clamp(39px, vw(40px, $desktop), 40px)
      clamp(15px, vw(16px, $desktop), 16px) clamp(15px, vw(16px, $desktop), 16px);
    margin-left: auto;

    // max-width: clamp(900px, vw(900px, $desktop), 900px);
    display: flex;
    gap: clamp(16px, vw(24px, $desktop), 24px);
    align-items: flex-start;
    @media (min-width: $tab) {
      //
    }
    @media (min-width: $desk) {
      align-items: center;
      width: 63%;
    }
  }
  &__plate-left {
    background: var(--color);
    border-radius: 20px;
    padding: clamp(13px, vw(23px, $desktop), 23px) clamp(11px, vw(20px, $desktop), 20px);
  }
  &__plate-left img {
    width: 100%;
    height: 100%;
    min-width: clamp(40px, vw(44px, $desktop), 44px);
    max-width: clamp(60px, vw(61px, $desktop), 61px);
  }
  &__plate-right {
  }
  &__plate-right-title {
    font-weight: 600;
    font-size: clamp(18px, vw(21px, $desktop), 21px);
    line-height: 136%;
    letter-spacing: 0em;
    color: var(--100);
    margin-bottom: clamp(8px, vw(12px, $desktop), 12px);
  }
  &__plate-right-text {
    font-weight: 400;
    font-size: clamp(16px, vw(18px, $desktop), 18px);
    line-height: 146%;
    color: var(--80);
    margin-bottom: clamp(4px, vw(4px, $desktop), 4px);
  }
  &__plate-right-email {
    color: var(--80);
  }
  &__plate-right-email a {
    color: var(--2);
  }
  &__plate-right-email a:hover {
    color: var(--1);
  }
}
</style>
