<script setup>
import { ref } from 'vue'

import Breadcrumbs from '@/components/Breadcrumbs.vue'
import FaqBlock from '@/layouts/mortgage-installment/FaqBlock.vue'
import MainBlock from '@/layouts/mortgage-installment/MainBlock.vue'
import VariationsBlock from '@/layouts/mortgage-installment/VariationsBlock.vue'
import AdventBlock from '@/layouts/mortgage-installment/AdventBlock.vue'
import CallbackBlock from '@/layouts/mortgage-installment/CallbackBlock.vue'
import Maps from '@/components/Maps.vue'
import Projects from '@/layouts/Projects.vue'

const variationsItems = [
  {
    title: 'Раз в квартал',
    text: 'Платеж 200 000 руб. один раз в квартал, остаток до даты срока сдачи дома (объекта)',
    img: '/imgs/mort-inst/ii-1.svg',
    items: [
      { title: 'от 20%', text: 'Первоначальный взнос' },
      { title: 'от 0%', text: 'Процентная ставка' },
      { title: 'до сдачи дома', text: 'Макс. срок рассрочки (кредита)' },
      // { title: 'полная стоимость квартиры', text: 'Макс. сумма рассрочки (кредита):' },
    ],
  },
  {
    title: 'Раз в месяц',
    text: 'Платеж 50 000 руб. один раз в месяц, остаток до даты сдачи дома (объекта)',
    img: '/imgs/mort-inst/ii-2.svg',
    items: [
      { title: 'от 20%', text: 'Первоначальный взнос' },
      { title: 'от 0%', text: 'Процентная ставка' },
      { title: 'до сдачи дома', text: 'Макс. срок рассрочки (кредита)' },
      // { title: 'полная стоимость квартиры', text: 'Макс. сумма рассрочки (кредита):' },
    ],
  },
  {
    title: 'Равные платежи',
    text: 'Остаток разбивается на равные ежеквартальные  платежи до даты сдачи объекта.',
    img: '/imgs/mort-inst/ii-3.svg',
    items: [
      { title: 'от 20%', text: 'Первоначальный взнос' },
      { title: 'от 0%', text: 'Процентная ставка' },
      { title: 'до сдачи дома', text: 'Макс. срок кредита' },
      // { title: 'стоимость квартиры (объекта)', text: 'Макс. сумма кредита:' },
    ],
  },
]

const adventItems = [
  {
    text: 'Небольшой первоначальный взнос',
    img: '/imgs/mort-inst/aa-1.svg',
  },
  {
    text: 'Отсутствие переплат % по рассрочки - без переплат',
    img: '/imgs/mort-inst/aa-2.svg',
  },
  {
    text: 'Сниженные ежеквартальные и ежемесячные платежи',
    img: '/imgs/mort-inst/aa-3.svg',
  },
  {
    text: 'Возможность перехода на ипотеку после ввода объекта в эксплуатацию (при большом остатке в конце срока)',
    img: '/imgs/mort-inst/aa-4.svg',
  },
]
const faqList = ref([
  {
    question: 'Чем рассрочка отличается от ипотеки?',
    answer: `
Основное отличие — рассрочку предоставляет застройщик, а не банк. 
При рассрочке:
— не требуется банковское одобрение;
— часто отсутствуют проценты или они минимальны;
— срок рассрочки обычно короче, чем срок ипотеки.
`,
  },
  {
    question: 'Как работает рассрочка при покупке квартиры?',
    answer: 'Покупатель вносит первоначальный взнос, после чего оставшаяся стоимость квартиры делится на несколько платежей. График платежей закрепляется в договоре.',
  },
  {
    question: 'Нужен ли первоначальный взнос?',
    answer: 'Да. Как правило, застройщики устанавливают первоначальный взнос от 10% до 30% стоимости квартиры. Точный размер зависит от условий конкретного жилого комплекса и срока рассрочки.',
  },
  {
    question: 'На какой срок предоставляется рассрочка?',
    answer: 'До конца срока строительства (ввода в эксплуатацию).',
  },
  {
    question: 'Есть ли проценты по рассрочке?',
    answer: 'Беспроцентная рассрочка не предусматривает выплату дополнительных процентов.',
  },
  {
    question: 'Можно ли купить квартиру в рассрочку без подтверждения дохода?',
    answer: 'Да. В большинстве случаев подтверждение дохода не требуется, поскольку рассрочку предоставляет сам застройщик, а не банк.',
  },
  {
    question: 'Какие документы нужны для оформления рассрочки?',
    answer: `
    Обычно достаточно:
    — паспорта покупателя;
    — договора долевого участия или договора купли-продажи.

    Дополнительные документы могут потребоваться в отдельных случаях.
    `,
  },
  {
    question: 'Что будет, если задержать платеж?',
    answer: 'При просрочке платежа могут начисляться штрафные санкции, предусмотренные договором. Поэтому важно соблюдать график платежей или заранее согласовать изменения с застройщиком.',
  },
  {
    question: 'Можно ли оформить рассрочку иностранным гражданам?',
    answer: 'Да, во многих проектах это возможно. Условия оформления уточняются у менеджеров отдела продаж.',
  },
])

const btnText = {
  text1: 'Рассчитать ипотеку',
  text2: 'Выбрать квартиру',
}
</script>

<template>
  <Breadcrumbs />
  <MainBlock :title="'Рассрочка: все возможно!'"
    :description="'Мы создали для вас гибкие условия покупки, чтобы мечта о своей квартире исполнилась уже сегодня!'"
    :btn="btnText.text2" :img="'/imgs/mort-inst/rass-bg.png'" :items="[
      { title: '3 способа', text: 'погашения рассрочки, которые будут удобны каждому' },
      { title: 'Условие', text: 'которое коротко и выгодно показывает вариант рассрочки' },
    ]" />
  <VariationsBlock :title="'Предоставляем рассрочку на'" :items="variationsItems" />
  <AdventBlock :title="'Преимущества рассрочки'" :items="adventItems" />
  <FaqBlock :items="faqList" />
  <Projects></Projects>
   <!-- <CallbackBlock :isblue="true" /> -->
  <Maps></Maps>

</template>

<style lang="scss" scoped>
@import '../assets/styles/index';

.company {}
</style>
