<script setup>
import { ref } from 'vue'

import Breadcrumbs from '@/components/Breadcrumbs.vue'
import FaqBlock from '@/layouts/mortgage-installment/FaqBlock.vue'
import MainBlock from '@/layouts/mortgage-installment/MainBlock.vue'
import VariationsBlock from '@/layouts/mortgage-installment/VariationsBlock.vue'
import AdventBlock from '@/layouts/mortgage-installment/AdventBlock.vue'
import Cc from '@/layouts/Cc.vue'
import CallbackBlock from '@/layouts/mortgage-installment/CallbackBlock.vue'

const variationsItems = [
  {
    title: 'Cемейная ипотека',
    text: 'Это государственная программа льготного ипотечного кредитования для семей с детьми, которая позволяет купить жильё по сниженной процентной ставке',
    img: '/imgs/mort-inst/i-1.svg',
    items: [
       { title: 'от 20,1%', text: 'Первоначальный взнос' },
      { title: 'от 4,5%', text: 'Процентная ставка' },
      { title: '30 лет', text: 'Макс. cрок кредита' },
      { title: '6 млн', text: 'Макс. сумма кредита, ₽' },
    ],
  },
  {
    title: 'ИТ ипотека',
    text: 'Это государственная программа льготного ипотечного кредитования для специалистов, работающих в сфере информационных технологий. Она позволяет приобрести жильё по сниженной процентной ставке при поддержке государства.',
    img: '/imgs/mort-inst/i-2.svg',
    items: [
      { title: 'от 20,1%', text: 'Первоначальный взнос' },
      { title: 'от 4,5%', text: 'Процентная ставка' },
      { title: '30 лет', text: 'Макс. cрок кредита' },
      { title: '9 млн', text: 'Макс. сумма кредита, ₽' },
    ],
  },
  {
    title: 'Ипотека по базовой ставке',
    text: 'Это стандартная ипотечная программа банка без государственных льгот и субсидий. Процентная ставка по такому кредиту устанавливается банком и зависит от текущих рыночных условий, кредитной истории заемщика и размера первоначального взноса',
    img: '/imgs/mort-inst/i-3.svg',
    items: [
      { title: 'от 20,1%', text: 'Первоначальный взнос' },
      { title: 'от 18,7%', text: 'Процентная ставка' },
      { title: '30 лет', text: 'Макс. cрок кредита' },
      { title: 'до 30 млн', text: 'Макс. сумма кредита, ₽' },
    ],
  },
  {
    title: 'Ипотека банка России',
    text: 'это государственная программа поддержки военнослужащих, которая позволяет купить жильё с использованием целевого ипотечного кредита. При этом значительную часть выплат по кредиту осуществляет государство.',
    img: '/imgs/mort-inst/i-3.svg',
    items: [
      { title: 'от 20,1%', text: 'Первоначальный взнос' },
      { title: 'от 18,7%', text: 'Процентная ставка' },
      { title: '25 лет', text: 'Макс. cрок кредита' },
      { title: 'до 4 млн', text: 'Макс. сумма кредита, ₽' },
    ],
  },
  {
    title: 'Траншевая ипотека',
    text: 'Это ипотечная программа, при которой банк перечисляет сумму кредита застройщику поэтапно (траншами), а не сразу полностью. Покупатель сначала платит только небольшие платежи по первому траншу, а основной кредит начинает выплачиваться после ввода дома в эксплуатацию или получения следующего транша.',
    img: '/imgs/mort-inst/i-3.svg',
    items: [
      { title: 'от 20,1%', text: 'Первоначальный взнос' },
      { title: 'от 18,7%', text: 'Процентная ставка' },
      { title: '30 лет', text: 'Макс. cрок кредита' },
      { title: 'до 100 млн', text: 'Макс. сумма кредита, ₽' },
    ],
  },
]

const adventItems = [
  {
    text: 'Возможность купить жильё сразу',
    img: '/imgs/mort-inst/a-1.svg',
  },
  {
    text: 'Длительный срок кредитования',
    img: '/imgs/mort-inst/a-2.svg',
  },
  {
    text: 'Государственные программы поддержки',
    img: '/imgs/mort-inst/a-3.svg',
  },
  {
    text: 'Возможность досрочного погашения',
    img: '/imgs/mort-inst/a-4.svg',
  },
]

const faqList = ref([
  {
    question: 'Какие виды ипотеки доступны при покупке квартиры?',
     answer: `
     Покупатели могут оформить различные ипотечные программы, например:
     — семейную ипотеку
     — IT-ипотеку
     — ипотеку по базовой ставке
     — ипотеку с господдержкой (при наличии программы)

     Конкретные условия зависят от банка и выбранного жилого комплекса.
     `,
  },
  {
    question: 'Какой первоначальный взнос по ипотеке?',
    answer: 'Минимальный первоначальный взнос обычно составляет от 15–20% стоимости квартиры, однако он может отличаться в зависимости от банка и программы.',
  },
  {
    question: 'На какой срок можно оформить ипотеку?',
    answer: 'Ипотечный кредит обычно оформляется на срок до 30 лет. При этом заемщик может погасить кредит досрочно.',
  },
  {
    question: 'Можно ли использовать материнский капитал?',
     answer: `
     Да, материнский капитал можно использовать:
     — для первоначального взноса.
     — для частичного погашения ипотечного кредита.
     `,
  },
  {
    question: 'Можно ли оформить ипотеку на двух человек?',
    answer: 'Да, ипотеку можно оформить на созаемщиков, например супругов или родственников. Это может увеличить сумму одобренного кредита.',
  },
  {
    question: 'Как узнать, какую сумму ипотеки одобрит банк?',
    answer: 'Банк рассчитывает сумму кредита исходя из дохода заемщика, его кредитной истории, размера первоначального взноса и стоимости недвижимости.',
  },
])

const btnText = {
  text1: 'Рассчитать ипотеку',
  text2: 'Выбрать квартиру',
}
</script>

<template>
  <Breadcrumbs />
  <MainBlock
    :title="'Возможность исполнить мечту о собственной квартире'"
    :description="'Уникальные ипотечные программы и специальные условия от ведущих банков.'"
    :btn="btnText.text1"
    :img="'/imgs/mort-inst/image1.png'"
    :items="[
      { title: '98% одобрений', text: 'высокая вероятность получить ипотеку' },
      // { title: '37 партнёров', text: 'подберём лучшие условия для вас в банках' },
    ]"
  />
  <VariationsBlock :title="'Варианты ипотеки'" :items="variationsItems" />
  <Cc></Cc>
  <AdventBlock :title="'Преимущества ипотеки'" :items="adventItems" />
  <FaqBlock :items="faqList" />
   <!-- <CallbackBlock /> -->
</template>

<style lang="scss" scoped>
@import '../assets/styles/index';

.company {
}
</style>
